{
    "chatbot-patterns": {
        "greetings_patterns": [
            { "pattern": "hi|hello|hey|hola|bonjour", "responses": ["Hello!", "Hi there!", "Hey!", "Hola!", "Bonjour!"] },
            { "pattern": "how are you\\??", "responses": ["I'm good, thank you!", "I'm doing well, thanks for asking."] },
            { "pattern": "what is your name\\??", "responses": ["You can call me ShapeFlowBot.", "I go by the name ShapeFlowBot."] },
            { "pattern": "my name is (.*)", "responses": ["Nice to meet you, %1!", "Glad to meet you, %1!"] },
            { "pattern": "thank you|thanks", "responses": ["You're welcome!", "Happy to help!", "Anytime!"] },
            { "pattern": "goodbye|bye|see you", "responses": ["Goodbye!", "See you later!", "Take care!"] }
        ],
        "cloud_patterns": [
            { "pattern": "(.*\\bexplain cloud\\b.*)", "responses": ["Cloud computing is the delivery of computing services over the internet, which allows users to access and use resources such as servers, storage, databases, networking, software, analytics, and intelligence from anywhere at any time. Cloud computing services are typically categorized into three types: Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS). The benefits of cloud computing include cost savings, scalability, flexibility, and disaster recovery. It enables organizations to quickly scale their IT resources as needed and only pay for what they use."] },
            { "pattern": "(.*\\bprivate cloud\\b.*)", "responses": ["Private Cloud: A private cloud is a cloud computing environment that is dedicated solely to one organization. It is usually managed either by the organization itself or by a third-party service provider. The infrastructure and services are not shared with other organizations, offering greater control, security, and customization options. Private clouds are typically used by large enterprises or organizations with specific compliance or security requirements. They offer benefits such as improved security, compliance with regulatory standards, and customizable infrastructure."] },
            { "pattern": "(.*\\bpublic cloud\\b.*)", "responses": ["Public Cloud: A public cloud is a cloud computing environment that is hosted and managed by a third-party service provider and made available to multiple organizations or individuals over the internet. The infrastructure and resources are shared among multiple users, offering scalability, flexibility, and cost-effectiveness. Public clouds are accessible to anyone who wants to use them and are often used for general-purpose computing needs such as web hosting, development, and testing. They provide advantages like reduced costs, no need for hardware maintenance, and easy scalability."] },
            { "pattern": "(.*\\bhybrid cloud\\b.*)", "responses": ["Hybrid Cloud: A hybrid cloud is a computing environment that combines elements of both private and public clouds. It allows organizations to leverage the benefits of both environments by integrating on-premises infrastructure with public cloud resources. This integration enables data and applications to be dynamically moved between the two environments based on changing workload demands, security requirements, and cost considerations. Hybrid clouds offer greater flexibility, scalability, and customization options compared to using either private or public clouds alone. They are commonly used by organizations that want to retain control over sensitive data while taking advantage of the scalability and cost-effectiveness of public cloud services."] },
            { "pattern": "(.*\\bcloud computing\\b.*)", "responses": ["Cloud computing is the delivery of computing services over the internet, which allows users to access and use resources such as servers, storage, databases, networking, software, analytics, and intelligence from anywhere at any time. Cloud computing services are typically categorized into three types: Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS). The benefits of cloud computing include cost savings, scalability, flexibility, and disaster recovery. It enables organizations to quickly scale their IT resources as needed and only pay for what they use."] },
            { "pattern": "what is (.*) cloud", "responses": ["Cloud computing is the delivery of computing services over the internet, which allows users to access and use resources such as servers, storage, databases, networking, software, analytics, and intelligence from anywhere at any time. Cloud computing services are typically categorized into three types: Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS). The benefits of cloud computing include cost savings, scalability, flexibility, and disaster recovery. It enables organizations to quickly scale their IT resources as needed and only pay for what they use."] }
        ],
        "onshape_patterns": [
            { "pattern": "what is onshape\\??", "responses": ["OnShape is a cloud-based CAD platform that allows teams to collaborate on designing products in real time."] },
            { "pattern": "what (.*) onshape\\??", "responses": ["OnShape is a cloud-based CAD platform that allows teams to collaborate on designing products in real time."] },
            { "pattern": "how do i use onshape\\??", "responses": ["You can use OnShape by signing up for an account, creating a new document, and starting your design using its powerful CAD tools."] },
            { "pattern": "what are the benefits of using onshape\\??", "responses": ["Using OnShape offers benefits like real-time collaboration, version control, and access from any device with an internet connection."] },
            { "pattern": "how does onshape support collaboration\\??", "responses": ["OnShape supports co llaboration by allowing multiple users to work on the same document simultaneously, with changes being updated in real-time."] },
            { "pattern": "what file formats does onshape support\\??", "responses": ["OnShape supports various file formats including STEP, IGES, STL, and many others for import and export."] },
            { "pattern": "is onshape secure\\??", "responses": ["Yes, OnShape uses industry-standard security measures to protect your data, including encryption and regular security audits."] },
            { "pattern": "can i use onshape for free\\??", "responses": ["OnShape offers a free plan with limited features, as well as professional plans with more advanced capabilities."] },
            { "pattern": "what industries use onshape\\??", "responses": ["OnShape is used in various industries including manufacturing, engineering, product design, and education."] },
            { "pattern": "does onshape have version control\\??", "responses": ["Yes, OnShape includes robust version control features that allow you to track changes, revert to previous versions, and manage design iterations."] },
            { "pattern": "what are cad tools in onshape\\??", "responses": ["CAD tools in OnShape include features for 2D sketching, 3D modeling, assembly, and drawing creation, among others."] },
            { "pattern": "can onshape be integrated with other tools\\??", "responses": ["Yes, OnShape can be integrated with other tools and services through its API and various plugins."] }
        ],
        "shapeflow_patterns": [
            { "pattern": "what is (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["ShapeFlow Monitor is a cloud-based web application designed for analyzing and visualizing onShape log data."] },
            { "pattern": "how does (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project) work\\??", "responses": ["ShapeFlow Monitor leverages Google Colab, Firebase, and onShape to provide an interactive dashboard for monitoring activity logs and document usage."] },
            { "pattern": "what can i do with (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["With ShapeFlow Monitor, you can visualize onShape log data through interactive charts and graphs, and monitor activity logs and document usage."] },
            { "pattern": "how do i use the dashboard (in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["The dashboard in ShapeFlow Monitor provides an overview of your data, including visualizations and summaries of activity logs and document usage."] },
            { "pattern": "how do i use the search feature (in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["You can use the search feature to look up specific terms in the glossary or find particular logs and entries in the database."] },
            { "pattern": "what are the key features (of|in) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["Key features include interactive dashboards, Firebase integration, ngrok integration, comprehensive logging, and cloud-based infrastructure."] },
            { "pattern": "is (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project) secure\\??", "responses": ["Yes, ShapeFlow Monitor uses secure cloud services to ensure data privacy and integrity."] },
            { "pattern": "how do i upload logs (to|in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["You can upload logs through the upload feature on the platform, which supports various log formats including JSON."] },
            { "pattern": "how do i visualize log data (in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["You can visualize log data using the interactive graphs and charts available on the dashboard page."] },
            { "pattern": "how do i analyze logs (in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["Analyze logs using the interactive dashboards and visualizations provided by ShapeFlow Monitor."] },
            { "pattern": "what types of logs can i analyze (with|in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["You can analyze various logs related to onShape activity and document usage."] },
            { "pattern": "how do i use the interactive dashboards (in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["The interactive dashboards can be accessed through the web interface of ShapeFlow Monitor, allowing you to visualize log data."] },
            { "pattern": "how do i search the glossary (in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["Use the search feature to look up specific glossary terms. The glossary contains definitions and explanations of terms used in onShape and ShapeFlow Monitor."] },
            { "pattern": "what visualizations are available (in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["ShapeFlow Monitor provides various visualizations including line charts, bar graphs, and pie charts to help you understand your log data."] },
            { "pattern": "how do i filter log data (in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["You can filter log data by date, type, or other criteria using the filter options available on the dashboard."] },
            { "pattern": "can i export visualizations (from|in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["Yes, you can export visualizations as images or PDFs from the dashboard page."] },
            { "pattern": "how do i access different pages (in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["Navigate through the application using the menu or navigation bar to access different pages such as the dashboard, logs, and glossary."] },
            { "pattern": "how do i update log data (in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["Update log data by re-uploading the latest logs or by making adjustments through the data management features available."] },
            { "pattern": "what is the purpose of the glossary (in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["The glossary provides definitions and explanations for various terms used within onShape and ShapeFlow Monitor."] },
            { "pattern": "how do i contact support (for|in) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["Contact support through the support page or by reaching out to the developers listed in the application."] },
            { "pattern": "what graphs are supported (in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["ShapeFlow Monitor supports various types of graphs including line graphs, bar charts, pie charts, and more for visualizing log data."] },
            { "pattern": "how do i navigate the (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project) application\\??", "responses": ["Navigate the application using the menu or navigation bar to access different features and pages."] },
            { "pattern": "can i customize the visualizations (in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["Yes, you can customize the visualizations by adjusting the settings available on the dashboard."] },
            { "pattern": "how do i use the data analysis tools (in|on) (shapeflow monitor|shapeflow|sfm|shape flow monitor|shape flow|this webapp|this project)\\??", "responses": ["Use the data analysis tools available on the dashboard to analyze log data, filter results, and generate reports."] }
        ]
    }
}
