{
  "chatbot-patterns": {
    "greetings_patterns": [
      { "pattern": "hi|hello|hey|hola|bonjour", "responses": ["Hello!", "Hi there!", "Hey!", "Hola!", "Bonjour!"] },
      { "pattern": "how are you\\??", "responses": ["I'm good, thank you!", "I'm doing well, thanks for asking."] },
      { "pattern": "what is your name\\??", "responses": ["You can call me ShapeFlowBot.", "I go by the name ShapeFlowBot."] },
      { "pattern": "my name is (.*)", "responses": ["Nice to meet you, %1!", "Glad to meet you, %1!"] },
      { "pattern": "thank you|thanks", "responses": ["You're welcome!", "Happy to help!", "Anytime!"] },
      { "pattern": "goodbye|bye|see you", "responses": ["Goodbye!", "See you later!", "Take care!"] },
      { "pattern": "help|\\b(what can you do)\\b|\\b(help me)\\b", "responses": ["I can assist you with various tasks related to ShapeFlow Monitor and Onshape. Here are some things I can help you with:\n\n**ShapeFlow Monitor:**\n- Explain what ShapeFlow Monitor is and how it works.\n- Guide you on uploading logs and searching the glossary.\n- Guide you how to view and filter graphs.\n- Guide you how to view student working hours during weekends and holidays.\n\n**Onshape:**\n- Provide information about Onshape and its features.\n- Discuss Onshape's integration with other tools.\n\nYou can also search for specific topics like:\n- Cloud computing\n- Onshape features and benefits\n- ShapeFlow Monitor setup and usage\n- CAD tools and version control\n\nIf you need help with something specific, just let me know!"] }
    ],
    "cloud_patterns": [
      {
        "pattern": "(.*\\bexplain cloud\\b.*)",
        "responses": [
          "Cloud computing is the delivery of computing services over the internet, which allows users to access and use resources such as servers, storage, databases, networking, software, analytics, and intelligence from anywhere at any time. Cloud computing services are typically categorized into three types: Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS). The benefits of cloud computing include cost savings, scalability, flexibility, and disaster recovery. It enables organizations to quickly scale their IT resources as needed and only pay for what they use."
        ]
      },
      {
        "pattern": "(.*\\bprivate cloud\\b.*)",
        "responses": [
          "Private Cloud: A private cloud is a cloud computing environment that is dedicated solely to one organization. It is usually managed either by the organization itself or by a third-party service provider. The infrastructure and services are not shared with other organizations, offering greater control, security, and customization options. Private clouds are typically used by large enterprises or organizations with specific compliance or security requirements. They offer benefits such as improved security, compliance with regulatory standards, and customizable infrastructure."
        ]
      },
      {
        "pattern": "(.*\\bpublic cloud\\b.*)",
        "responses": [
          "Public Cloud: A public cloud is a cloud computing environment that is hosted and managed by a third-party service provider and made available to multiple organizations or individuals over the internet. The infrastructure and resources are shared among multiple users, offering scalability, flexibility, and cost-effectiveness. Public clouds are accessible to anyone who wants to use them and are often used for general-purpose computing needs such as web hosting, development, and testing. They provide advantages like reduced costs, no need for hardware maintenance, and easy scalability."
        ]
      },
      {
        "pattern": "(.*\\bhybrid cloud\\b.*)",
        "responses": [
          "Hybrid Cloud: A hybrid cloud is a computing environment that combines elements of both private and public clouds. It allows organizations to leverage the benefits of both environments by integrating on-premises infrastructure with public cloud resources. This integration enables data and applications to be dynamically moved between the two environments based on changing workload demands, security requirements, and cost considerations. Hybrid clouds offer greater flexibility, scalability, and customization options compared to using either private or public clouds alone. They are commonly used by organizations that want to retain control over sensitive data while taking advantage of the scalability and cost-effectiveness of public cloud services."
        ]
      },
      {
        "pattern": "(.*\\bcloud computing\\b.*)",
        "responses": [
          "Cloud computing is the delivery of computing services over the internet, which allows users to access and use resources such as servers, storage, databases, networking, software, analytics, and intelligence from anywhere at any time. Cloud computing services are typically categorized into three types: Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS). The benefits of cloud computing include cost savings, scalability, flexibility, and disaster recovery. It enables organizations to quickly scale their IT resources as needed and only pay for what they use."
        ]
      },
      {
        "pattern": "what is (.*) cloud",
        "responses": [
          "Cloud computing is the delivery of computing services over the internet, which allows users to access and use resources such as servers, storage, databases, networking, software, analytics, and intelligence from anywhere at any time. Cloud computing services are typically categorized into three types: Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS). The benefits of cloud computing include cost savings, scalability, flexibility, and disaster recovery. It enables organizations to quickly scale their IT resources as needed and only pay for what they use."
        ]
      }
    ],
    "onshape_patterns": [
      { "pattern": "(.*\\bwhat is cad\\b.*)|\\b(CAD)\\b", "responses": ["CAD stands for Computer-Aided Design. It is the use of computer software to facilitate the creation, modification, analysis, or optimization of a design. CAD software is commonly used in various industries for creating detailed 2D drawings and 3D models. It enhances precision, productivity, and communication in design processes."]},
      { "pattern": "what is onshape\\??", "responses": ["OnShape is a cloud-based CAD platform that allows teams to collaborate on designing products in real time."] },
      { "pattern": "what (.*) onshape\\??", "responses": ["OnShape is a cloud-based CAD platform that allows teams to collaborate on designing products in real time."] },
      {
        "pattern": "how do i use onshape\\??",
        "responses": [
          "You can use OnShape by signing up for an account, creating a new document, and starting your design using its powerful CAD tools."
        ]
      },
      {
        "pattern": "what are the benefits of using onshape\\??",
        "responses": [
          "Using OnShape offers benefits like real-time collaboration, version control, and access from any device with an internet connection."
        ]
      },
      {
        "pattern": "how does onshape support collaboration\\??",
        "responses": [
          "OnShape supports collaboration by allowing multiple users to work on the same document simultaneously, with changes being updated in real-time."
        ]
      },
      {
        "pattern": "what file formats does onshape support\\??",
        "responses": [
          "OnShape supports various file formats including STEP, IGES, STL, and many others for import and export."
        ]
      },
      {
        "pattern": "is onshape secure\\??",
        "responses": [
          "Yes, OnShape uses industry-standard security measures to protect your data, including encryption and regular security audits."
        ]
      },
      {
        "pattern": "can i use onshape for free\\??",
        "responses": [
          "OnShape offers a free plan with limited features, as well as professional plans with more advanced capabilities."
        ]
      },
      {
        "pattern": "what industries use onshape\\??",
        "responses": [
          "OnShape is used in various industries including manufacturing, engineering, product design, and education."
        ]
      },
      {
        "pattern": "does onshape have version control\\??",
        "responses": [
          "Yes, OnShape includes robust version control features that allow you to track changes, revert to previous versions, and manage design iterations."
        ]
      },
      {
        "pattern": "what are cad tools in onshape\\??",
        "responses": [
          "CAD tools in OnShape include features for 2D sketching, 3D modeling, assembly, and drawing creation, among others."
        ]
      },
      {
        "pattern": "can onshape be integrated with other tools\\??",
        "responses": [
          "Yes, OnShape can be integrated with other tools and services through its API and various plugins."
        ]
      },
      {
        "pattern": "how do i get started with onshape\\??",
        "responses": [
          "To get started with Onshape, create an account on their website, explore the tutorials, and begin a new project by creating a document."
        ]
      },
      {
        "pattern": "how do i collaborate on designs in onshape\\??",
        "responses": [
          "You can collaborate by sharing your Onshape document with team members, allowing them to edit or view the design in real time.",
          "Use the 'Share' feature to invite others to your document and set permissions for editing or viewing."
        ]
      },
      {
        "pattern": "how do i import cad files into onshape\\??",
        "responses": [
          "Import CAD files by clicking on 'Import' in the Documents page and selecting the files from your computer. Onshape supports formats like STEP, IGES, and STL."
        ]
      },
      {
        "pattern": "how do i create assemblies in onshape\\??",
        "responses": [
          "To create assemblies, use the 'Assembly' workspace to bring parts together, using mates to define relationships between them.",
          "Start an assembly by adding parts from your document and using the mate connectors to assemble them."
        ]
      },
      {
        "pattern": "how do i use onshape on mobile devices\\??",
        "responses": [
          "Download the Onshape app from the App Store or Google Play to access and edit your projects on the go.",
          "Onshape's mobile app allows you to view, edit, and collaborate on designs from your smartphone or tablet."
        ]
      },
      {
        "pattern": "how do i access onshape learning resources\\??",
        "responses": [
          "Visit Onshape's Learning Center for tutorials, webinars, and documentation to help you get started.",
          "Onshape offers a range of learning materials, including videos and self-paced courses, available on their website."
        ]
      },
      {
        "pattern": "how does onshape handle design iterations\\??",
        "responses": [
          "Onshape's version control and branching features allow you to manage and iterate on designs efficiently.",
          "Create branches to explore design alternatives without affecting the main version, and merge changes when ready."
        ]
      },
      {
        "pattern": "how do i share my onshape projects\\??",
        "responses": [
          "Use the 'Share' option in Onshape to generate a link or directly invite collaborators via email, setting permissions as needed."
        ]
      },
      {
        "pattern": "what makes onshape different from other cad software\\??",
        "responses": [
          "Onshape's unique features include cloud-based collaboration, real-time editing, and robust version control, setting it apart from traditional CAD software.",
          "Its ability to facilitate simultaneous collaboration and automatic updates makes it a standout choice for modern CAD design."
        ]
      },
      {
        "pattern": "why choose onshape\\??",
        "responses": [
          "Choose Onshape for its cloud-based architecture, which allows easy collaboration and access from anywhere.",
          "Its cloud-native approach provides seamless updates and accessibility from any device with an internet connection."
        ]
      },
      {
        "pattern": "what features does onshape offer\\??",
        "responses": [
          "Onshape offers features like parametric modeling, assembly design, version control, and collaboration tools.",
          "Key features include multi-part modeling, simultaneous editing, and a comprehensive set of CAD tools for creating detailed designs."
        ]
      },
      {
        "pattern": "what industries benefit from onshape\\??",
        "responses": [
          "Industries like automotive, aerospace, consumer electronics, and industrial equipment benefit from using Onshape for product development.",
          "Onshape is used in diverse fields, including architecture, medical device manufacturing, and education, due to its versatile design capabilities."
        ]
      },
      {
        "pattern": "what support options are available for onshape\\??",
        "responses": [
          "Onshape offers support through its Help Center, community forums, and direct customer support for paid plans.",
          "You can access support via the Onshape website, where you'll find documentation, tutorials, and a community of users."
        ]
      },
      {
        "pattern": "why choose onshape over traditional cad software\\??",
        "responses": [
          "Onshape's cloud-based nature eliminates installation hassles, ensures easy collaboration, and allows access from any device.",
          "Its real-time collaboration feature and automatic updates make it a modern alternative to traditional CAD software."
        ]
      },
      {
        "pattern": "why is onshape ideal for teams\\??",
        "responses": [
          "Onshape allows multiple team members to work on the same project simultaneously, facilitating collaboration and reducing design cycle times.",
          "Teams benefit from its version control system, which tracks changes and allows easy rollback to previous versions."
        ]
      },
      {
        "pattern": "why is onshape suitable for education\\??",
        "responses": [
          "Onshape offers free educational plans, enabling students and educators to access professional-grade CAD tools for learning and teaching.",
          "Its cloud-based platform makes it easy for students to access their work from anywhere, fostering collaboration in educational settings."
        ]
      },
      {
        "pattern": "why use onshape for prototyping\\??",
        "responses": [
          "Onshape's robust modeling tools and integration with 3D printing services make it ideal for rapid prototyping and iteration.",
          "Its cloud-based collaboration ensures that design changes are instantly reflected, speeding up the prototyping process."
        ]
      },
      {
        "pattern": "why is onshape popular among startups\\??",
        "responses": [
          "Startups benefit from Onshape's cost-effective subscription plans, real-time collaboration, and flexibility in scaling their design capabilities.",
          "Its cloud infrastructure allows startups to quickly iterate on designs and collaborate without investing in expensive hardware or software."
        ]
      },
      {
        "pattern": "how do i export designs from onshape\\??",
        "responses": [
          "Export your designs from Onshape by selecting the desired format, such as STEP, STL, or DXF, and choosing the export option in your document.",
          "Use the export feature to save your designs in various formats for manufacturing or sharing with collaborators."
        ]
      },
      {
        "pattern": "how do i integrate onshape with other tools\\??",
        "responses": [
          "Onshape offers integration with various tools through its API, allowing you to connect with platforms like Google Drive, SolidWorks, and more.",
          "Use the Onshape App Store to find plugins and integrations that extend the functionality of your Onshape environment."
        ]
      },
      { "pattern": "\\b(free)\\b", "responses": ["OnShape offers a free plan with limited features, as well as professional plans with more advanced capabilities.", "There is a free version of Onshape available that offers basic features for personal use and learning."] },
      { "pattern": "\\b(version control)\\b", "responses": ["Onshape's version control system keeps track of all changes, allowing you to revert to previous versions and manage design iterations effectively.", "With Onshape, you can use version control to maintain a history of your design changes and easily manage different iterations."] },
      { "pattern": "\\b(cloud-based)\\b", "responses": ["Onshape is a cloud-based CAD platform, which means you can access your projects from any device with an internet connection.", "Being cloud-based allows Onshape to offer seamless updates and easy collaboration without the need for complex installations."] },
      { "pattern": "\\b(parametric modeling)\\b", "responses": ["Onshape supports parametric modeling, allowing you to define relationships between parts and make changes that automatically update related components.", "The parametric modeling tools in Onshape enable designers to create complex models with interdependent features that adjust based on defined parameters."] },
      {
        "pattern": "\\b(onshape)\\b|\\b(on shape)\\b|\\b(on-shape)\\b",
        "responses": [
          "OnShape is a cloud-based CAD platform that allows teams to collaborate on designing products in real time.",
          "Onshape is known for its cloud-based architecture, enabling easy collaboration and access from any device."
        ]
      },
      {
        "pattern": "\\b(cloud)\\b",
        "responses": [
          "Cloud computing enables access to resources over the internet, allowing for scalable, flexible, and cost-effective computing solutions.",
          "Onshape is a cloud-based platform, offering seamless updates and collaboration without the need for installations."
        ]
      },
      {
        "pattern": "\\b(cad tools)\\b",
        "responses": [
          "Onshape's CAD tools include 2D sketching, 3D modeling, assemblies, and more, providing a comprehensive suite for design.",
          "The CAD tools in Onshape are designed to support complex modeling tasks, with features for parametric and direct editing."
        ]
      },
      {
        "pattern": "\\b(onshape design)\\b",
        "responses": [
          "Onshape design capabilities include robust modeling tools, real-time collaboration, and powerful version control.",
          "Design with Onshape to leverage its cloud-based features for efficient collaboration and precise modeling."
        ]
      },
      {
        "pattern": "\\b(version control)\\b",
        "responses": [
          "Onshape's version control system keeps track of all changes, allowing you to revert to previous versions and manage design iterations effectively.",
          "With Onshape, you can use version control to maintain a history of your design changes and easily manage different iterations."
        ]
      },
      {
        "pattern": "\\b(real-time collaboration)\\b",
        "responses": [
          "Onshape supports real-time collaboration, allowing multiple users to edit a document simultaneously and see each other's changes instantly.",
          "The platform's real-time collaboration features make it easy for teams to work together from different locations without delays."
        ]
      },
      {
        "pattern": "\\b(parametric modeling)\\b",
        "responses": [
          "Onshape supports parametric modeling, allowing you to define relationships between parts and make changes that automatically update related components.",
          "The parametric modeling tools in Onshape enable designers to create complex models with interdependent features that adjust based on defined parameters."
        ]
      },
      {
        "pattern": "\\b(3d printing)\\b",
        "responses": [
          "Onshape integrates with various 3D printing services, making it easy to prepare and export your designs for 3D printing.",
          "Use Onshape's export tools to generate STL files suitable for 3D printing and rapid prototyping."
        ]
      },
      {
        "pattern": "\\b(education)\\b",
        "responses": [
          "Onshape offers free plans for educational institutions, providing students and educators with access to professional CAD tools.",
          "The cloud-based nature of Onshape makes it ideal for education, facilitating collaboration and remote learning."
        ]
      },
      {
        "pattern": "\\b(subscriptions)\\b|\\b(sub)\\b|\\b(subs)\\b|\\b(subscription)\\b",
        "responses": [
          "Onshape offers various subscription plans, including free options and professional packages with advanced features.",
          "Choose a subscription plan that fits your needs, from individual users to enterprise-level deployments."
        ]
      },
      {
        "pattern": "\\b(automotive)\\b",
        "responses": [
          "The automotive industry benefits from Onshape's capabilities in complex modeling and collaborative design processes.",
          "Onshape supports automotive design with features that streamline workflows and improve team collaboration."
        ]
      }
    ],"shapeflow_patterns": [
    {
      "pattern": "\\b(shapeflow monitor)\\b|\\b(shape flow monitor)\\b|\\b(shapeflow)\\b|\\b(shape flow)\\b|\\b(sfm)\\b|\\b(what is this site?)\\b|\\b(what is this app)\\b|\\b(what is this application)\\b",
      "responses": [
        "ShapeFlow Monitor is a tool for Onshape that tracks activities and displays graphs.",
        "The ShapeFlow Monitor helps you keep track of Onshape activities with visual graphs and real-time updates."
      ]
    },
    {
      "pattern": "what is shapeflow\\??",
      "responses": [
        "ShapeFlow is a tool designed to monitor activities in Onshape and visualize them through graphs.",
        "ShapeFlow allows you to track and analyze Onshape activities with intuitive graphs and reports."
      ]
    },
    {
      "pattern": "how does shapeflow work\\??",
      "responses": [
        "ShapeFlow integrates with Onshape to monitor activities and generate graphical reports, providing insights into your design workflow.",
        "The ShapeFlow Monitor collects data from Onshape activities and visualizes them in easy-to-understand graphs."
      ]
    },
    {
      "pattern": "can shapeflow be integrated with other tools\\??",
      "responses": [
        "Yes, ShapeFlow can be integrated with various tools to enhance its functionality and provide comprehensive activity tracking.",
        "ShapeFlow supports integration with third-party tools, allowing for extended capabilities and seamless workflows."
      ]
    },
    {
      "pattern": "how do i set up shapeflow\\??|\\b(setup)\\b|\\b(shapeflow setup)\\b|\\\\b(shapeflow monitor setup)\\\\b\"",
      "responses": [
        "To set up ShapeFlow, follow the installation guide provided with the project and configure the necessary connections with Onshape.",
        "Setting up ShapeFlow involves installing the necessary components and linking it with your Onshape account for activity tracking."
      ]
    },
    {
      "pattern": "what features does shapeflow offer\\??",
      "responses": [
        "ShapeFlow offers features such as real-time activity tracking, graphical visualization of data, and integration with other tools.",
        "The key features of ShapeFlow include activity monitoring, data analysis, and customizable graph displays."
      ]
    }
  ],"shapeflow_usage_patterns": [
    {
      "pattern": "how do i use logs\\??|\\b(logs)\\b|\\b(what is logs)\\b",
      "responses": [
        "To use logs in ShapeFlow, you can import a JSON file containing the logs using upload file function and use the glossary search to find specific data.",
        "ShapeFlow allows you to upload JSON log files using upload file function, which you can then search and analyze using the glossary and graphing tools."
      ]
    },
    {
      "pattern": "how do i upload logs\\??|\\b(upload logs)\\b|\\b(how to upload logs)\\b",
      "responses": [
        "You can upload logs by navigating to the 'Import Logs' section and selecting the JSON file you wish to upload.",
        "To upload logs, click on the 'Upload' button, choose your JSON file, and confirm the upload to import the logs into ShapeFlow."
      ]
    },
    {
      "pattern": "how do i search in the glossary\\??|\\b(glossary)\\b|\\b(search in glossary)\\b|\\b(search glossary)\\b",
      "responses": [
        "To search in the glossary use the search glossary function , enter your query in the search bar and the relevant data from the imported logs will be displayed.",
        "Use the glossary search feature by typing keywords related to your query, and ShapeFlow will fetch matching data from the logs."
      ]
    },
    {
      "pattern": "how do i see working hours of students during weekends nights and holidays\\??|\\b(students work hours)\\b|\\b(students hours)\\b|\\b(work hours)\\b",
      "responses": [
        "To view working hours of students during weekends, nights, and holidays, use the working hours function on the log data in ShapeFlow.",
        "Use the working hours function in ShapeFlow to watch weekends, nights, and holidays working hours data."
      ]
    },
    {
      "pattern": "how do i replace a default log\\??|\\b(replace a default log)\\b|\\b(replace default log)\\b|\\b(replace log)\\b",
      "responses": [
        "Replace a default log by uploading a new log and setting it as the default in the log upload function",
        "To replace a default log, import a new log file and designate it as the default checking the default data source check box."
      ]
    },
    {
      "pattern": "how do i view the new filtered graphs\\??|\\b(Graphs)\\b|\\b(view graphs)\\b|\\b(how to view graphs)\\b|\\b(how view graphs)\\b",
      "responses": [
        "To view new filtered graphs use the Graphs function, apply the desired filters such as document, user, log, and time range, then click 'Apply Filters'.",
        "Use the Graphs function to set your filters, including document, user, log type, and time period, and click 'Apply' to generate the graphs."
      ]
    }
  ]
  }
}
